In [34]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline

In [35]:
file_path = '/Users/claire/git/flatiron/phase_02/finalproject/DSC-Phase2-Project2/unzippedData/im.db'
conn = sqlite3.connect(file_path)

In [36]:
! ls ../unzippedData

ls: ../unzippedData: No such file or directory

In [37]:
cursor = conn.cursor()

![Image of ERD Diagram IMDB](https://raw.githubusercontent.com/learn-co-curriculum/dsc-phase-2-project-v3/main/movie_data_erd.jpeg)

In [38]:
# Create a dataframe from the master table of our sql database:
# Write the query:
imdb_query = """ 
    SELECT *
    FROM sqlite_master
"""
# Read the contents of the query into a Pandas dataframe:
imdb_df = pd.read_sql(imdb_query, conn)

# From the pandas dataframe, iterate through the column "name" (all our table names)
# Make a list of those table names:
table_list = [name for name in imdb_df['name']]

def table_to_df(my_table, my_conn):
    '''Input is name of database table as a string, output is dataframe'''
    my_query = f"""SELECT * FROM {my_table}"""
    df = pd.read_sql(my_query, my_conn)
    return df

# Make a dataframe where the keys are the names of the tables, 
# and the values are pandas dataframes made from those tables:
dict_tables = {name: pd.DataFrame(data=table_to_df(name,conn)) for name in table_list}

# Make dataframe names, prefixed by "df_" and then the original table name
# Output is 
for i in range(len(table_list)):
    # converts the STRING f"df_{table_list[i]}" to a VARIABLE equal to each df in df_tables
    exec(f"{table_list[i]}_df" + " = dict_tables[table_list[i]]") 
    

# Lez try out one of our brand-new dfs!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#writers_df.head()

####### We now have these dataframes:
"""
movie_basics_df
directors_df
known_for_df
movie_akas_df
movie_ratings_df
persons_df
principals_df
writers_df
"""

'\nmovie_basics_df\ndirectors_df\nknown_for_df\nmovie_akas_df\nmovie_ratings_df\npersons_df\nprincipals_df\nwriters_df\n'

In [39]:
# Export Pandas dataframes to CSV:

### Used for Tableau Analysis:
#directors_df.to_csv('../../csv_exports_for_tableau/directors.csv')
#persons_df.to_csv('../../csv_exports_for_tableau/persons.csv')
#movie_basics_df.to_csv('../../csv_exports_for_tableau/movie_basics.csv')

In [40]:
# Bring in movie_risk_NO_genre
movie_risk_NO_genre = pd.read_csv('../../csv_exports_for_tableau/movie_risk_NO_genre.csv')

In [41]:
movie_risk_NO_genre['movie_id'] = movie_risk_NO_genre['Movie ID']

In [42]:
movie_risk_NO_genre.head()

,index,Movie ID,Movie,Release Date,ARR,prod_budget_bucket,movie_id
0,3886,tt4064912,Shine,1996,6.667726,b1,tt4064912
1,3887,tt2229499,Don Jon,2013,7.503378,b1,tt2229499
2,3887,tt2229499,Don Jon,2013,7.503378,b1,tt2229499
3,3887,tt2229499,Don Jon,2013,7.503378,b1,tt2229499
4,3888,tt1999890,Hell Fest,2018,3.294406,b1,tt1999890

In [43]:
movie_basics_df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [44]:
# Use the imported movie_risk_NO_genre as a filter for movie_basics_df:
movie_risk_genre = movie_risk_NO_genre.merge(movie_basics_df, on = 'movie_id', how='left')

In [45]:
movie_risk_genre.head()

,index,Movie ID,Movie,Release Date,ARR,prod_budget_bucket,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,3886,tt4064912,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music"
1,3887,tt2229499,Don Jon,2013,7.503378,b1,tt2229499,Don Jon,Don Jon,2013,90.0,"Comedy,Drama,Romance"
2,3887,tt2229499,Don Jon,2013,7.503378,b1,tt2229499,Don Jon,Don Jon,2013,90.0,"Comedy,Drama,Romance"
3,3887,tt2229499,Don Jon,2013,7.503378,b1,tt2229499,Don Jon,Don Jon,2013,90.0,"Comedy,Drama,Romance"
4,3888,tt1999890,Hell Fest,2018,3.294406,b1,tt1999890,Hell Fest,Hell Fest,2018,89.0,Horror

In [46]:
movie_risk_genre = movie_risk_genre.drop('Movie ID', axis=1)

In [53]:
movie_risk_genre_director = movie_risk_genre.merge(directors_df, on = 'movie_id', how='left')
#movie_risk_genre_director = directors_df.merge(movie_risk_genre, on = 'movie_id', how='left')

In [54]:
movie_risk_genre_director.head()

,index,Movie,Release Date,ARR,prod_budget_bucket,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,person_id
0,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004
1,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004
2,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004
3,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004
4,3887,Don Jon,2013,7.503378,b1,tt2229499,Don Jon,Don Jon,2013,90.0,"Comedy,Drama,Romance",nm0330687

In [59]:
movie_genre_directors = movie_risk_genre_director.merge(persons_df, on = 'person_id', how='left')

In [60]:
movie_genre_directors.head()

,index,Movie,Release Date,ARR,prod_budget_bucket,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,person_id,primary_name,birth_year,death_year,primary_profession
0,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004,Anthony Nardolillo,NaN,NaN,"director,writer,producer"
1,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004,Anthony Nardolillo,NaN,NaN,"director,writer,producer"
2,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004,Anthony Nardolillo,NaN,NaN,"director,writer,producer"
3,3886,Shine,1996,6.667726,b1,tt4064912,Shine,Shine,2017,95.0,"Drama,Music",nm2493004,Anthony Nardolillo,NaN,NaN,"director,writer,producer"
4,3887,Don Jon,2013,7.503378,b1,tt2229499,Don Jon,Don Jon,2013,90.0,"Comedy,Drama,Romance",nm0330687,Joseph Gordon-Levitt,1981.0,NaN,"actor,producer,soundtrack"

In [61]:
movie_genre_directors = movie_genre_directors.drop_duplicates()

In [63]:
movie_genre_directors.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2394 entries, 0 to 12657
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   index               2394 non-null   int64
 1   Movie               2394 non-null   object
 2   Release Date        2394 non-null   int64
 3   ARR                 2394 non-null   float64
 4   prod_budget_bucket  2394 non-null   object
 5   movie_id            2394 non-null   object
 6   primary_title       2394 non-null   object
 7   original_title      2394 non-null   object
 8   start_year          2394 non-null   int64
 9   runtime_minutes     2238 non-null   float64
 10  genres              2394 non-null   object
 11  person_id           2383 non-null   object
 12  primary_name        2383 non-null   object
 13  birth_year          1410 non-null   float64
 14  death_year          22 non-null     float64
 15  primary_profession  2381 non-null   object
dtypes: float64(4), int64(3), object(9)
memory usage: 318.0+ KB

In [64]:
movie_genre_directors.to_csv('../../csv_exports_for_tableau/movie_genre_directors.csv')